In [2]:
import pandas as pd
import numpy as np

In [6]:
Series_a=pd.Series([7,11,13,17])
Series_a

0     7
1    11
2    13
3    17
dtype: int64

In [8]:
Series_b=pd.Series([100.0]*5)
Series_b

0    100.0
1    100.0
2    100.0
3    100.0
4    100.0
dtype: float64

In [38]:
Series_c=pd.Series(np.random.rand(20))
print(Series_c)
print(Series_c.describe())

0     0.457669
1     0.074548
2     0.644425
3     0.651605
4     0.923987
5     0.414464
6     0.599711
7     0.817793
8     0.505633
9     0.941292
10    0.073722
11    0.824671
12    0.510003
13    0.745032
14    0.901382
15    0.101317
16    0.346577
17    0.433766
18    0.470868
19    0.582107
dtype: float64
count    20.000000
mean      0.551029
std       0.268543
min       0.073722
25%       0.428941
50%       0.546055
75%       0.763222
max       0.941292
dtype: float64

In [20]:
temperatues = pd.Series([98.6,99.9,100.2,97.9],
                       index=['Julie','Charlie','Sam','Andrea'])
print(temperatues)

Julie       98.6
Charlie     99.9
Sam        100.2
Andrea      97.9
dtype: float64

In [28]:
dict_temp={'Julie':98.6, 'Charlie': 99.9, 'Sam': 100.2, 'Andrea': 97.9}
series_d = pd.Series(dict_temp)
print(series_d)

Julie       98.6
Charlie     99.9
Sam        100.2
Andrea      97.9
dtype: float64

# Q3

In [133]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James',
'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no',
'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [135]:
df=df.set_index('name')
df

           score  attempts qualify
name
Anastasia   12.5         1     yes
Dima         9.0         3      no
Katherine   16.5         2     yes
James        NaN         3      no
Emily        9.0         2      no
Michael     20.0         3     yes
Matthew     14.5         1     yes
Laura        NaN         1      no
Kevin        8.0         2      no
Jonas       19.0         1     yes

# DataFrame needs to be stored after changing index

In [139]:
df=df.reset_index() # Reseting to chnage name to Suresh
print(df)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [127]:
df.loc[df['name'] =='James', 'name'] = 'Suresh'
print(df)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3     Suresh    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [141]:
# OR

# Replace 'James' with 'Suresh'
df['name']=df['name'].replace('James','Suresh')
print(df)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3     Suresh    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [145]:
colors = ['Red', 'Blue,', 'Orange', 'Purple', 'White', 'Violet', 'abc','djjd', 'kkj', 'sjjsj']
df['color'] = colors
print(df)

        name  score  attempts qualify   color
0  Anastasia   12.5         1     yes     Red
1       Dima    9.0         3      no   Blue,
2  Katherine   16.5         2     yes  Orange
3     Suresh    NaN         3      no  Purple
4      Emily    9.0         2      no   White
5    Michael   20.0         3     yes  Violet
6    Matthew   14.5         1     yes     abc
7      Laura    NaN         1      no    djjd
8      Kevin    8.0         2      no     kkj
9      Jonas   19.0         1     yes   sjjsj

In [161]:
l=[df.head(0)]
print(l)

[Empty DataFrame
Columns: [name, score, attempts, qualify, color]
Index: []]